; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph4 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	infrared0 - mode
	image3 - mode
	infrared5 - mode
	GroundStation5 - direction
	Star4 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation2 - direction
	Star1 - direction
	Star6 - direction
	Star3 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument3 spectrograph2)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared5)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared5)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star7)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph2)
	(supports instrument8 infrared5)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star6)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(have_image Planet8 image3)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 image3)
	(have_image Planet9 infrared5)
	(have_image Planet10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Star11 image3)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation2 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite3 planet9 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet9)
   goals met: 0 of 9
5. (take_image satellite3 planet9 instrument6 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 1 of 9
6. (take_image satellite3 planet9 instrument6 image3)
   added: (have_image planet9 image3)
   goals met: 2 of 9
7. (turn_to satellite3 phenomenon13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 9
8. (take_image satellite3 phenomenon13 instrument6 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 9
9. (turn_to satellite3 planet8 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 planet8)
   goals met: 3 of 9
10. (turn_to satellite1 groundstation0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation0)
   goals met: 3 of 9
11. (take_image satellite3 planet8 instrument6 image3)
   added: (have_image planet8 image3)
   goals met: 4 of 9
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 9
13. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 4 of 9
14. (take_image satellite3 planet8 instrument6 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 9
15. (turn_to satellite1 phenomenon12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon12)
   goals met: 5 of 9
16. (take_image satellite1 phenomenon12 instrument3 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 6 of 9
17. (turn_to satellite1 planet10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet10)
   goals met: 6 of 9
18. (take_image satellite1 planet10 instrument3 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 7 of 9
19. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 7 of 9
20. (take_image satellite1 star11 instrument3 image3)
   added: (have_image star11 image3)
   goals met: 8 of 9
21. (take_image satellite1 star11 instrument3 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 9 of 9
